
adding new columns  ,   adding new rows

deletion of rows or columns

In [ ]:
# adding new rows/updating the data:

1) using append function
2) using loc/iloc

In [ ]:
# libraries
import pandas as pd

df.append(other, ignore_index  = , sort = )
other : DataFrame or Series/dict-like object, or list of these. The data to append.

In [ ]:
df = pd.DataFrame({'name':pd.Series(['riya','julie','marie','sandy','garim','darsh','ranisha','john']),'age':pd.Series([15,16,15,15,16,15,15,15]),'eng_marks':pd.Series([78,45,90,88,65,94,52,63]),'sci_marks':pd.Series([87,54,100,78,55,44,92,73])})
df

      name  age  eng_marks  sci_marks
0     riya   15         78         87
1    julie   16         45         54
2    marie   15         90        100
3    sandy   15         88         78
4    garim   16         65         55
5    darsh   15         94         44
6  ranisha   15         52         92
7     john   15         63         73

In [ ]:
# //if new_data to be added is a dictionary
new_data = {'name':'kri','age':16,'eng_marks':89,'sci_marks':91}
df = df.append(pd.Series(new_data,name='new_row'))
# if we are pd series/dict, there has to be a name or ignore_index must be true so that it can assign a next index on its own.

In [ ]:
# //if new_data to be added is a list
new_data = [{'name':'sam','age':16,'eng_marks':84,'sci_marks':61}]
df = df.append(new_data,ignore_index=True)
# new_data.index({'name':'sam','age':16,'eng_marks':84,'sci_marks':61})

In [ ]:
# if new_data to be added is a data frame
new_data = {'name':'sam','age':16,'eng_marks':84,'sci_marks':61}
df = df.append(pd.DataFrame(new_data,index =[10]))
df

       name  age  eng_marks  sci_marks
0      riya   15         78         87
1     julie   16         45         54
2     marie   15         90        100
3     sandy   15         88         78
4     garim   16         65         55
5     darsh   15         94         44
6   ranisha   15         52         92
7      john   15         63         73
8       kri   16         89         91
9       sam   16         84         61
10      sam   16         84         61

In [ ]:
# so to summaise what we have covered so far is:
# for passing a list, never be a problem.
# for passing a series,dict - must name the series or just pass ignore_index - True
# for passing a data frame, we have to either make df from a list or pass index

In [ ]:
# using loc[] / iloc[]
new_data = [{'name':'sami','age':16,'eng_marks':44,'sci_marks':66}]
df.loc[len(df)] = list(new_data[0].values())
df

                 name                age          eng_marks          sci_marks
0                riya                 15                 78                 87
1               julie                 16                 45                 54
2               marie                 15                 90                100
3               sandy                 15                 88                 78
4               garim                 16                 65                 55
5               darsh                 15                 94                 44
6             ranisha                 15                 52                 92
7                john                 15                 63                 73
8                 kri                 16                 89                 91
9                 sam                 16                 84                 61
10                sam                 16                 84                 61
11  (sam, 16, 84, 61)  (sam, 16, 84, 61)  (sam, 16, 84, 61)  (sam, 16, 84, 61)
12  (sam, 16, 84, 61)  (sam, 16, 84, 61)  (sam, 16, 84, 61)  (sam, 16, 84, 61)
13               sami                 16                 44                 66

In [ ]:
df.drop(12,inplace=True)

In [ ]:
df

       name age eng_marks sci_marks
0      riya  15        78        87
1     julie  16        45        54
2     marie  15        90       100
3     sandy  15        88        78
4     garim  16        65        55
5     darsh  15        94        44
6   ranisha  15        52        92
7      john  15        63        73
8       kri  16        89        91
9       sam  16        84        61
10      sam  16        84        61
13     sami  16        44        66

In [ ]:

df['total_marks']=df['eng_marks'] + df['sci_marks']
df.head()

    name age eng_marks sci_marks total_marks
0   riya  15        78        87         165
1  julie  16        45        54          99
2  marie  15        90       100         190
3  sandy  15        88        78         166
4  garim  16        65        55         120

In [ ]:
df['percentage'] = (df['total_marks']/200)*100
df.head()

    name age eng_marks sci_marks total_marks percentage
0   riya  15        78        87         165       82.5
1  julie  16        45        54          99       49.5
2  marie  15        90       100         190         95
3  sandy  15        88        78         166         83
4  garim  16        65        55         120         60

<!-- adding new columns: -->

# adding new columns

## **we can also assign() function to add new columns.**
syntax:df.assign(**kwargs) -> 'DataFrame'
Assign new columns to a DataFrame.

Returns a new object with all original columns in addition to new ones. Existing columns that are re-assigned will be overwritten.

Parameters
**kwargs : dict of {str: callable or Series}  
    The column names are keywords. If the values are  
    callable, they are computed on the DataFrame and  
    assigned to the new columns. The callable must not  
    change input DataFrame (though pandas doesn't check it).

In [ ]:
# if the percentage is more than 50% then students are pass
result = []
for percent in df['percentage']:
  if percent > 50:
    result.append('pass')
  else:
    result.append('better luck next time')

df = df.assign(result= result)
df.head()

    name age eng_marks sci_marks total_marks percentage                 result
0   riya  15        78        87         165       82.5                   pass
1  julie  16        45        54          99       49.5  better luck next time
2  marie  15        90       100         190         95                   pass
3  sandy  15        88        78         166         83                   pass
4  garim  16        65        55         120         60                   pass

In [ ]:
result = ['pass' if per>50 else 'work hard'for per in df['percentage']]
df = df.assign(new_result = result)

# DELETION OF ROWS AND COLUMNS

In [ ]:
# we can use index labels for deletion of rows
# use column names for deletion of columns

In [ ]:
df = pd.DataFrame({'name':pd.Series(['riya','julie','marie','sandy','garim','darsh','ranisha','john']),'age':pd.Series([15,16,15,15,16,15,15,15]),'eng_marks':pd.Series([78,45,90,88,65,94,52,63]),'sci_marks':pd.Series([87,54,100,78,55,44,92,73])})

In [ ]:
# using index labels :
df.drop(9,axis =0,inplace=True)
df.tail()

       name age eng_marks sci_marks total_marks percentage result
6   ranisha  15        52        92         144         72   pass
7      john  15        63        73         136         68   pass
8       kri  16        89        91         180         90   pass
10      sam  16        84        61         145       72.5   pass
13     sami  16        44        66         110         55   pass

In [ ]:
#using column names
df.drop(['new_result'],axis = 1,inplace = True)

In [ ]:
df

       name age eng_marks  ... total_marks percentage                 result
0      riya  15        78  ...         165       82.5                   pass
1     julie  16        45  ...          99       49.5  better luck next time
2     marie  15        90  ...         190         95                   pass
3     sandy  15        88  ...         166         83                   pass
4     garim  16        65  ...         120         60                   pass
5     darsh  15        94  ...         138         69                   pass
6   ranisha  15        52  ...         144         72                   pass
7      john  15        63  ...         136         68                   pass
8       kri  16        89  ...         180         90                   pass
10      sam  16        84  ...         145       72.5                   pass
13     sami  16        44  ...         110         55                   pass

[11 rows x 7 columns]

In [ ]:
df.append()